[{"id":"819b51","title":"What to do with cables that are too long","author":"jukbob12","selftext":"This goes for cables inside the case and outside of it (power, HDMI, USB peripherals, etc.)\n\nI've been trying to figure this out for a while, and no amount of web searching has been able to help me.\n\nWhat do I do with cables that are too long?\n\nIf I coil them up, then I end up with a mess of coils that are hard to manage because they are all different sizes, lengths, and weights.\n\nIf I let them hang, they get in the way and get tangled.\n\nDo I just lie to myself and stuff them underneath the PSU shroud/back panel/under the desk?\n\nIs my only recourse learning to solder and shortening every single cable I own/spending $$$ on custom cables?\n\nAny suggestions are welcome.","score":7},{"id":"7zx050","title":"First Build Cable Management","author":"D3ambro","selftext":"Hey guys! Built my first PC Thursday and tried my best with the cable management, any tips for improvement? I did zip tie the front panel connectors, both at the top where visible and the bottom. I'm gonna try to route the top exhaust fan cable behind the mobo to it's current connector if possible, anything else?\n\nhttps://imgur.com/a/3w90j\n","score":4},{"id":"7y36t7","title":"When building a PC, do you cable manage part by part, or after everything is installed?","author":"LeEpicBlob","selftext":"Looking for what people do when they cable manage their PC, thanks!","score":22},{"id":"7xysfy","title":"Just got a new hub for a new mac at my workplace and it is taking a lot of space on my desk. Looking for some suggestion on how to organize this.","author":"dodoloper","selftext":"[This is how it looks like so far.](https://i.imgur.com/tCfIUWW.jpg) Any ideas ?\n\n","score":6},{"id":"7x7e4r","title":"Cable managing mATX in ATX Case","author":"iamnoobtroll","selftext":"Got a define R5 and an micro ATX mobo, my only concern is on how the manage the power, audio, etc. cables that plug in at the very bottom of the motherboard. \n\nAny method on hiding, or at least cleaning up, those cables would be appreciated!","score":3},{"id":"7w8man","title":"What extensions do I need?","author":"Noclue23","selftext":"https://pcpartpicker.com/list/RXFVd6 This is my build, what cable extensions do I need to order for it to look clean.\n\nAny help would be really appreciated, I've never ordered extensions before.","score":3},{"id":"7vv85z","title":"What custom cables should I get?","author":"jupiters11","selftext":"Hello, I'll be building my first pc soon and I'd like to know what are the cables I'll be needing to get as custom colored. Also, what are all the accessories I should get to help me with cable management? \n\nWould a Cable Kit Starter Package be good?","score":9}]